app/controllers/admin/users_controller.rb

  def index
    @users = User.find(:all, :order => "Name, email")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1