app/views/albums/_form.html.erb

SELECT "tags".* FROM "tags"
---
<%= form.label :tags, 'Etiketler(Aralarına Boşluk Bırak)' %><br/>
<%= form.text_field :tags, {:autocomplete => "off", :class => 'tag_list', :value => (@album.tags.map { |tag| tag.title }.join(" ") unless @album.tags.nil?)} %>