app/views/albums/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 2 ORDER BY Id ASC
---
    <% count = 0.0 %>
    <% for photo in @album.photos.find(:all, :order => "Id ASC") %>

SELECT "collections".* FROM "collections" INNER JOIN "collection_albums" ON "collections"."id" = "collection_albums"."collection_id" WHERE "collection_albums"."album_id" = 2 ORDER BY title
---
        <td>
          <%= link_to image_tag(photo.file.preview.url), [@album.collections.first, @album, photo] %>