app/views/photos/_thumb.html.erb

SELECT "albums".* FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 9 ORDER BY title
SELECT "collections".* FROM "collections" INNER JOIN "collection_albums" ON "collections"."id" = "collection_albums"."collection_id" WHERE "collection_albums"."album_id" = 2 LIMIT 1
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 2 LIMIT 5 OFFSET 1
SELECT COUNT(*) FROM "photos" WHERE "photos"."album_id" = 2
---
<%= link_to (image_tag eval('photo.file.' + (defined?(photosize) ? photosize : "album") + '.url')), [photo.album.collections.first, photo.album, photo] %>