app/views/photos/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 LIMIT 1
SELECT "collections".* FROM "collections" INNER JOIN "collection_albums" ON "collections"."id" = "collection_albums"."collection_id" WHERE "collection_albums"."album_id" = 2 LIMIT 1
---
      <% unless @previous.nil? %>
          <%= link_to "Önceki", [@photo.album.collections.first, @photo.album, @previous] %>

SELECT "tags".* FROM "tags" INNER JOIN "photo_tags" ON "tags"."id" = "photo_tags"."tag_id" WHERE "photo_tags"."photo_id" = 3
---
<p>Etiketler:
  <% for tag in @photo.tags.map { |tag| tag.title }.sort %>