app/controllers/albums_controller.rb

  def index
    if params[:tag_id]
      @albums = Album.find(:all, :conditions => [ "id IN ( SELECT DISTINCT photos.album_id FROM photos WHERE photos.id IN ( SELECT photo_id FROM photo_tags WHERE photo_tags.tag_id = :q) )", { :q => Tag.find( params[:tag_id] ).id } ], :order => 'title')
    elsif params[:q]
      #search = params[:q]
      #search = search.split("AND").map{|q|q.strip}
      #@albums = Album.find(:all, :select => 'DISTINCT albums.id, albums.title', :limit => 20, :conditions => {  :tags => {:title => search}}, :joins => 'LEFT OUTER JOIN photos ON albums.id = photos.album_id LEFT OUTER JOIN photo_tags ON photos.id = photo_tags.photo_id LEFT OUTER JOIN tags ON photo_tags.tag_id = tags.id', :order => "albums.title ASC" )
      #@albums = Album.find(:all, :select => 'DISTINCT album_id', :conditions => [ "title LIKE :q OR description LIKE :q OR id IN ( SELECT DISTINCT photos.album_id FROM photos WHERE photos.description LIKE :q OR photos.title LIKE :q OR photos.id IN ( SELECT photo_id FROM photo_tags LEFT OUTER JOIN tags ON photo_tags.tag_id = tags.id WHERE tags.title LIKE :q) )", { :q => '%' + params[:q] + '%' } ], :order => 'title')
      params[:q].split(" AND ").each {|q|
        qphotos = Photo.find(:all, :select => 'DISTINCT album_id', :conditions => [ "description LIKE :q OR title LIKE :q OR id IN ( SELECT photo_id FROM photo_tags LEFT OUTER JOIN tags ON photo_tags.tag_id = tags.id WHERE tags.title LIKE :q)", { :q => '%' + q + '%' } ])
---
SELECT "albums".* FROM "albums" WHERE (title LIKE '%a%' OR description LIKE '%a%' OR id IN (NULL)) ORDER BY title
SELECT DISTINCT album_id FROM "photos" WHERE (description LIKE '%a%' OR title LIKE '%a%' OR id IN ( SELECT photo_id FROM photo_tags LEFT OUTER JOIN tags ON photo_tags.tag_id = tags.id WHERE tags.title LIKE '%a%'))

  def create
    @album = Album.new(params[:album])

    if @album.save
      flash[:notice] = "Album created! Now add some nice photos."
      if params[:collection_id]
        @album.collections << Collection.find( params[:collection_id] )
---
INSERT INTO "albums" ("address", "created_at", "description", "latitude", "longitude", "note", "path", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1-gtu"]]

  def edit
    @album = Album.find( params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1-albumum"]]

  def update
    @album = Album.find( params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1-albumum"]]

  def destroy
    @album = Album.find( params[:id])
    if @album.destroy
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1-albumum"]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]