app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."owner" = 'Alican'
---
  def index
    @collections = Collection.where(owner: @current_user.name)

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "9-gebze-teknik-universitesi"]]
SELECT "albums".* FROM "albums" INNER JOIN "collection_albums" ON "albums"."id" = "collection_albums"."album_id" WHERE "collection_albums"."collection_id" = 9 ORDER BY title
---
  def show
    @collection = Collection.find(params[:id])
    @albums = @collection.albums.find(:all, :order => 'title')

INSERT INTO "collections" ("created_at", "description", "owner", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 17 May 2016 20:57:44 UTC +00:00], ["description", "açıklama yok"], ["owner", nil], ["title", "GTÜ"], ["updated_at", Tue, 17 May 2016 20:57:44 UTC +00:00]]
---
  def create
    @collection = Collection.new(params[:collection])
    if @collection.save

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1-gtu"]]
---
  def edit
    @collection = Collection.find(params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1-gtu"]]
---
  def update
    @collection = Collection.find(params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1-gtu"]]
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 1]]
---
  def destroy
    @collection = Collection.find(params[:id])
    if @collection.destroy