app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "3-gebze-teknik-universitesi"]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "photos" WHERE (id > 3 AND album_Id = 2 ) LIMIT 1) subquery_for_count
---
  def show
    @photo = Photo.find(params[:id])
    previous_rs = Photo.previous(@photo.id, @photo.album)
    @previous = previous_rs.first unless previous_rs.empty?

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1-albumum"]]
---
  def upload
    @album = Album.find(params[:album_id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "1-albumum"]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1
---
  def edit_multiple
    if params[:album_id]
      @album = Album.find(params[:album_id])
      @photos = @album.photos
    else
      @photos = Photo.find(params[:photo_ids])