app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login_count", "name", "password_salt", "perishable_token", "persistence_token", "single_access_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 17 May 2016 20:57:23 UTC +00:00], ["name", "admin"], ["updated_at", Tue, 17 May 2016 20:57:23 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    if @user.save
      if User.all.length == 1
        @user.roles << Role.create(:name => 'admin')

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user = @current_user
    if @user.destroy